
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/haruguchi-yuma/aws-ecs-terraform/actions/runs/14287957167)



<pre><code>Apply complete! Resources: 23 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/3d78da9a-ddd3-41dc-82e6-0501e9fdd264/terraform-bin apply -auto-approve -input=false

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "aws-ecs-terraform-default"
        }
      + tags_all               = {
          + "Name" = "aws-ecs-terraform-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "aws-ecs-terraform-default"
        }
      + tags_all               = {
          + "Name" = "aws-ecs-terraform-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aws-ecs-terraform-default"
        }
      + tags_all               = {
          + "Name" = "aws-ecs-terraform-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "aws-ecs-terraform"
        }
      + tags_all = {
          + "Name" = "aws-ecs-terraform"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + tags_all                           = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all                           = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1a"
        }
      + tags_all         = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"
        }
      + tags_all         = {
          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aws-ecs-terraform-public"
        }
      + tags_all         = {
          + "Name" = "aws-ecs-terraform-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "aws-ecs-terraform"
        }
      + tags_all                             = {
          + "Name" = "aws-ecs-terraform"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.
module.vpc.aws_vpc.this[0]: Creating...
module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.vpc.aws_vpc.this[0]: Creation complete after 12s [id=vpc-02a7999140cb7d46b]
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_default_route_table.default[0]: Creating...
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_route_table.private[1]: Creating...
module.vpc.aws_route_table.private[0]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_default_security_group.this[0]: Creating...
module.vpc.aws_default_network_acl.this[0]: Creating...
module.vpc.aws_subnet.public[1]: Creation complete after 1s [id=subnet-0683321158553d692]
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-083b13fd8062f5801]
module.vpc.aws_internet_gateway.this[0]: Creation complete after 2s [id=igw-0c79b8ce30703dd14]
module.vpc.aws_eip.nat[1]: Creating...
module.vpc.aws_eip.nat[0]: Creating...
module.vpc.aws_subnet.public[0]: Creation complete after 2s [id=subnet-08c4c6f0fdf563338]
module.vpc.aws_route_table.private[1]: Creation complete after 2s [id=rtb-0ebdf5ff77b8d2269]
module.vpc.aws_route_table.public[0]: Creation complete after 2s [id=rtb-054620f453b63a8dd]
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_route_table.private[0]: Creation complete after 2s [id=rtb-0cd033fa9e54ffeb8]
module.vpc.aws_subnet.private[0]: Creation complete after 2s [id=subnet-0de12d0e72aff9d6a]
module.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-056447c0f16234a92]
module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.aws_route_table_association.public[0]: Creation complete after 0s [id=rtbassoc-07699eac2ec2333ab]
module.vpc.aws_route_table_association.public[1]: Creation complete after 0s [id=rtbassoc-07102b0ebd9f490c1]
module.vpc.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-02ee760d8bf1079fa]
module.vpc.aws_eip.nat[1]: Creation complete after 1s [id=eipalloc-0e7655c2afa897b05]
module.vpc.aws_nat_gateway.this[1]: Creating...
module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.aws_default_security_group.this[0]: Creation complete after 3s [id=sg-01a98b100a9e90a27]
module.vpc.aws_default_network_acl.this[0]: Creation complete after 3s [id=acl-00a371ec09c5c42c7]
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-054620f453b63a8dd1080289494]
module.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-036840bbfc61d3a71]
module.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-084cb5bd4ae4d314c]
module.vpc.aws_nat_gateway.this[1]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Creation complete after 1m45s [id=nat-0a29804183b7a0528]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m46s [id=nat-04324b55eef143096]
module.vpc.aws_route.private_nat_gateway[1]: Creating...
module.vpc.aws_route.private_nat_gateway[0]: Creating...
module.vpc.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-0cd033fa9e54ffeb81080289494]
module.vpc.aws_route.private_nat_gateway[1]: Creation complete after 1s [id=r-rtb-0ebdf5ff77b8d22691080289494]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 23 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.vpc.aws_default_network_acl.this[0] will be created%0A  + resource "aws_default_network_acl" "this" {%0A      + arn                    = (known after apply)%0A      + default_network_acl_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aws-ecs-terraform-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aws-ecs-terraform-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + egress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A        }%0A      + egress {%0A          + action     = "allow"%0A          + cidr_block = "0.0.0.0/0"%0A          + from_port  = 0%0A          + protocol   = "-1"%0A          + rule_no    = 100%0A          + to_port    = 0%0A        }%0A%0A      + ingress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A        }%0A      + ingress {%0A          + action     = "allow"%0A          + cidr_block = "0.0.0.0/0"%0A          + from_port  = 0%0A          + protocol   = "-1"%0A          + rule_no    = 100%0A          + to_port    = 0%0A        }%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be created%0A  + resource "aws_default_route_table" "default" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + route                  = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aws-ecs-terraform-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aws-ecs-terraform-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A          + update = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_default_security_group.this[0] will be created%0A  + resource "aws_default_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "aws-ecs-terraform-default"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aws-ecs-terraform-default"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] will be created%0A  + resource "aws_eip" "nat" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1a"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1a"%0A        }%0A      + vpc                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_eip.nat[1] will be created%0A  + resource "aws_eip" "nat" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1c"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1c"%0A        }%0A      + vpc                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_internet_gateway.this[0] will be created%0A  + resource "aws_internet_gateway" "this" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "aws-ecs-terraform"%0A        }%0A      + tags_all = {%0A          + "Name" = "aws-ecs-terraform"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] will be created%0A  + resource "aws_nat_gateway" "this" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1a"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1a"%0A        }%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[1] will be created%0A  + resource "aws_nat_gateway" "this" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1c"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aws-ecs-terraform-ap-northeast-1c"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.private_nat_gateway[0] will be created%0A  + resource "aws_route" "private_nat_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.private_nat_gateway[1] will be created%0A  + resource "aws_route" "private_nat_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.public_internet_gateway[0] will be created%0A  + resource "aws_route" "public_internet_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "aws-ecs-terraform-private-ap-northeast-1a"%0A        }%0A      + tags_all         = {%0A          + "Name" = "aws-ecs-terraform-private-ap-northeast-1a"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"%0A        }%0A      + tags_all         = {%0A          + "Name" = "aws-ecs-terraform-private-ap-northeast-1c"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "aws-ecs-terraform-public"%0A        }%0A      + tags_all         = {%0A          + "Name" = "aws-ecs-terraform-public"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Private Subnet 1a"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "Private Subnet 1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Private Subnet 1c"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "Private Subnet 1c"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.11.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Public Subnet 1a"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "Public Subnet 1a"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-northeast-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.12.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "Public Subnet 1c"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "Public Subnet 1c"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be created%0A  + resource "aws_vpc" "this" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "aws-ecs-terraform"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "aws-ecs-terraform"%0A        }%0A    }%0A%0APlan: 23 to add, 0 to change, 0 to destroy.%0Amodule.vpc.aws_vpc.this[0]: Creating...%0Amodule.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]%0Amodule.vpc.aws_vpc.this[0]: Creation complete after 12s [id=vpc-02a7999140cb7d46b]%0Amodule.vpc.aws_subnet.public[1]: Creating...%0Amodule.vpc.aws_subnet.public[0]: Creating...%0Amodule.vpc.aws_default_route_table.default[0]: Creating...%0Amodule.vpc.aws_route_table.public[0]: Creating...%0Amodule.vpc.aws_subnet.private[0]: Creating...%0Amodule.vpc.aws_route_table.private[1]: Creating...%0Amodule.vpc.aws_route_table.private[0]: Creating...%0Amodule.vpc.aws_internet_gateway.this[0]: Creating...%0Amodule.vpc.aws_default_security_group.this[0]: Creating...%0Amodule.vpc.aws_default_network_acl.this[0]: Creating...%0Amodule.vpc.aws_subnet.public[1]: Creation complete after 1s [id=subnet-0683321158553d692]%0Amodule.vpc.aws_subnet.private[1]: Creating...%0Amodule.vpc.aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-083b13fd8062f5801]%0Amodule.vpc.aws_internet_gateway.this[0]: Creation complete after 2s [id=igw-0c79b8ce30703dd14]%0Amodule.vpc.aws_eip.nat[1]: Creating...%0Amodule.vpc.aws_eip.nat[0]: Creating...%0Amodule.vpc.aws_subnet.public[0]: Creation complete after 2s [id=subnet-08c4c6f0fdf563338]%0Amodule.vpc.aws_route_table.private[1]: Creation complete after 2s [id=rtb-0ebdf5ff77b8d2269]%0Amodule.vpc.aws_route_table.public[0]: Creation complete after 2s [id=rtb-054620f453b63a8dd]%0Amodule.vpc.aws_route_table_association.public[1]: Creating...%0Amodule.vpc.aws_route_table_association.public[0]: Creating...%0Amodule.vpc.aws_route.public_internet_gateway[0]: Creating...%0Amodule.vpc.aws_route_table.private[0]: Creation complete after 2s [id=rtb-0cd033fa9e54ffeb8]%0Amodule.vpc.aws_subnet.private[0]: Creation complete after 2s [id=subnet-0de12d0e72aff9d6a]%0Amodule.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-056447c0f16234a92]%0Amodule.vpc.aws_route_table_association.private[1]: Creating...%0Amodule.vpc.aws_route_table_association.private[0]: Creating...%0Amodule.vpc.aws_route_table_association.public[0]: Creation complete after 0s [id=rtbassoc-07699eac2ec2333ab]%0Amodule.vpc.aws_route_table_association.public[1]: Creation complete after 0s [id=rtbassoc-07102b0ebd9f490c1]%0Amodule.vpc.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-02ee760d8bf1079fa]%0Amodule.vpc.aws_eip.nat[1]: Creation complete after 1s [id=eipalloc-0e7655c2afa897b05]%0Amodule.vpc.aws_nat_gateway.this[1]: Creating...%0Amodule.vpc.aws_nat_gateway.this[0]: Creating...%0Amodule.vpc.aws_default_security_group.this[0]: Creation complete after 3s [id=sg-01a98b100a9e90a27]%0Amodule.vpc.aws_default_network_acl.this[0]: Creation complete after 3s [id=acl-00a371ec09c5c42c7]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-054620f453b63a8dd1080289494]%0Amodule.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-036840bbfc61d3a71]%0Amodule.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-084cb5bd4ae4d314c]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [10s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [20s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [30s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [40s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [50s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [1m0s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [1m10s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [1m20s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [1m30s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]%0Amodule.vpc.aws_nat_gateway.this[0]: Still creating... [1m40s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Still creating... [1m40s elapsed]%0Amodule.vpc.aws_nat_gateway.this[1]: Creation complete after 1m45s [id=nat-0a29804183b7a0528]%0Amodule.vpc.aws_nat_gateway.this[0]: Creation complete after 1m46s [id=nat-04324b55eef143096]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Creating...%0Amodule.vpc.aws_route.private_nat_gateway[0]: Creating...%0Amodule.vpc.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-0cd033fa9e54ffeb81080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Creation complete after 1s [id=r-rtb-0ebdf5ff77b8d22691080289494]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 23 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"6bd8dc012e12b8a6a507bb1681936bc481bf13d0","Vars":{},"WorkflowName":"Terraform"} -->